{
  "accelerators": [
    {
      "title": "Pipelines",
      "url": "/accelerators/pipelines/",
      "urlTitle": "Learn more",
      "image": "/images/accelerators-details-pipeline.jpg",
      "body": "Pipelines is an accelerator for data integration use cases. It provides an easy-to-use graphical interface that allows you to bring together data from a myriad of different sources and define transformations visually. It lowers the barrier to data integration, and enables developers, business analysts and data scientists to quickly derive insights from data by cleansing, preparing, blending, transforming and transferring data without having to worry about infrastructure and integration.  <a href='#'>Learn More</a>"
    },
    {
      "title": "Preparation",
      "url": "/accelerators/preparation/",
      "urlTitle": "Learn more",
      "image": "/images/accelerators-details-preparation.jpg",
      "body": "Preparation allows you to visually and interactively cleanse and prepare raw data, with the aim of making it consumable for further processing. It provides a standardized UI driven interactive flow that takes the pain out of preprocessing tasks for data engineering, data science and data analysis. <a href='#'>Learn More</a>"
    },
    {
      "title": "Analytics",
      "url": "/accelerators/analytics/",
      "urlTitle": "Learn more",
      "image": "/images/accelerators-details-analytics.jpg",
      "body": "Analytics provides a simple, interactive, UI-driven approach to machine learning. It provides a seamless, automated interface for users to easily develop, train, test, evaluate and deploy their machine learning models. It reduces the need for ad-hoc custom tooling and promotes reusability and collaboration.  <a href='#'>Learn More</a>"
    },
    {
      "title": "Rules Engine",
      "url": "/accelerators/rules-engine/",
      "urlTitle": "Learn more",
      "image": "/images/accelerators-details-rules.jpg",
      "body": "Rules Engine provides a way for business analysts to create and manage a knowledge base of data transformation rules that need to be automatically applied to your data. It contains an intuitive UI for business analysts to set up business rules that can be executed in a data pipeline. <a href='#'>Learn More</a>"
    }
  ]
}
