{
  "features_home": [
    {
      "title": "CDAP features",
      "left_column": [
        {
          "header": "Rapid development",
          "paragraph": "Developer SDK and APIs with abstractions over common data processing patterns; Sandbox mode, programmatic and UI driven debugging; In-memory mode and testing framework to simplify testing; Support for cutting edge Cloud, Apache Hadoop and Apache Spark technologies.",
          "id": "feature_1"
        },
        {
          "header": "Seamless operations",
          "paragraph": "REST APIs and CLI for every interaction; Time and process based scheduling; Standardized logs and metrics for all execution environments.",
          "id": "feature_2"
        },
        {
          "header": "Extensible and reusable",
          "paragraph": "Templates and blueprints for common use-cases; Hub for sharing pre-built plugins, applications and solutions; Extensible APIs for security, metadata, runtimes and storage.",
          "id": "feature_3"
        }
      ],
      "right_column": [
        {
          "header": "Enterprise ready",
          "paragraph": "Metadata repository with automatic technical and operational metadata capture; Business metadata annotations; Data discovery through search based on metadata; Data governance with dataset and field level lineage and auditing; Integration with enterprise security systems.",
          "id": "feature_4"
        },
        {
          "header": "Portable runtime environments",
          "paragraph": "Build once, run anywhere through portability across runtime environments such as Kubernetes, Apache Hadoop YARN and Docker.",
          "id": "feature_5"
        },
        {
          "header": "Hybrid and multi cloud",
          "paragraph": "Interoperability across on-premises and Cloud environments; Support for all major public cloud providers such as Amazon Web Services, Microsoft Azure and Google Cloud Platform.",
          "id": "feature_6"
        }
      ]
    }
  ],
  "features_preparation": [
    {
      "title": "Preparation features",
      "left_column": [
        {
          "header": "Code free transformations",
          "paragraph": "Interactive, code-free transformations with feedback at each step using a powerful graphical UI"
        },
        {
          "header": "Extensible, comprehensive transformation library",
          "paragraph": "Comprehensive library with over 1000+ built-in transformations; Extensible API for adding more transformations"
        },
        {
          "header": "Comprehensive data source support",
          "paragraph": "Built-in connections to popular cloud and on-prem data sources such as relational databases, file systems, object stores such as AWS S3 and Cloud Storage, Kafka, NoSQL stores"
        }
      ],
      "right_column": [
        {
          "header": "Operationalization using pipelines",
          "paragraph": "One-click pipeline creation for creating scalable and reliable pipelines for mission critical environments"
        },
        {
          "header": "Automatic data quality and profiling",
          "paragraph": "Data quality indicators for determining data quality; data quality library for improving trust and quality; profiling to understand data distribution and column relationships after every transformation"
        }
      ]
    }
  ],
  "features_analytics": [
    {
      "title": "Analytics features",
      "left_column": [
        {
          "header": "UI driven data preparation and cleansing",
          "paragraph": "Seamless, integrated experience from data preparation and cleansing to model development, evaluation and deployment."
        },
        {
          "header": "Support for popular ML libraries",
          "paragraph": "Out of the box  support for common ML libraries such as SparkML"
        },
        {
          "header": "Scoring plugins for running predictions",
          "paragraph": "Built in scoring plugins take you from model development to running predictions on data in a few seconds."
        }
      ],
      "right_column": [
        {
          "header": "UI driven data preparation and cleansing",
          "paragraph": "Seamless, integrated experience from data preparation and cleansing to model development, evaluation and deployment."
        },
        {
          "header": "Support for popular ML libraries",
          "paragraph": "Out of the box  support for common ML libraries such as SparkML"
        },
        {
          "header": "Scoring plugins for running predictions",
          "paragraph": "Built in scoring plugins take you from model development to running predictions on data in a few seconds."
        }
      ]
    }
  ],
  "features_rules_engine": [
    {
      "title": "Rules Engine features",
      "left_column": [
        {
          "header": "Code-free business rules UI",
          "paragraph": "Intuitive, code-free UI for business analysts to build and manage transformation rules"
        },
        {
          "header": "Fully integrated",
          "paragraph": "Available as a library to integrate with JBoss, Spring, WebLogic and SQL tools"
        },
        {
          "header": "Easy governance",
          "paragraph": "Centralized repository of policies and transformation rules"
        }
      ],
      "right_column": [
        {
          "header": "Flexible and intuitive rules management",
          "paragraph": "Easy organization and grouping of rules using rulebooks; Intuitive business UI for creation and management of rules and rulebooks."
        },
        {
          "header": "Scalable",
          "paragraph": "Integrates with CDAP data pipelines for horizontal scalability"
        }
      ]
    }
  ],
  "features_pipeline": [
    {
      "title": "Pipelines",
      "left_column": [
        {
          "header": "Connector Ecosystem",
          "paragraph": "Built-in connectors to a variety of cloud and on-prem, modern and legacy systems; public APIs to build custom connectors"
        },
        {
          "header": "Visual data pipeline designer",
          "paragraph": "UI to build data pipelines using a point and click designer studio"
        },
        {
          "header": "Data Discovery and Governance",
          "paragraph": "UI to build data pipelines using a point and click designer studio"
        }
      ],
      "right_column": [
        {
          "header": "Comprehensive integration toolkit",
          "paragraph": "Conditionals and pre/post processing actions; Alerting and Notifications; Error processing"
        },
        {
          "header": "Interactive, code-free transformations",
          "paragraph": "Wide variety of built-in data transformation plugins; Interactive data transformation interface with feedback at each step."
        },
        {
          "header": "Seamless operations",
          "paragraph": "Time and process based scheduling, monitoring via logs, metrics, dashboards and reporting"
        }
      ]
    }
  ]
}
