{
  "hero_tabs": [
    {
      "id": "home",
      "active": true,
      "tabTitle": "On Cloud",
      "title": "Get started in the Cloud",
      "description": "Run CDAP on any major public cloud provider including <span style='white-space: nowrap;'>Amazon Web Services</span>, <span style='white-space: nowrap;',>Microsoft Azure</span> and <span style='white-space: nowrap;'>Google Cloud Platform</span>",
      "buttonTitle": "Get Started",
      "url": "/get-started"
    },
    {
      "id": "profile",
      "tabTitle": "On Premises",
      "title": "Get started on-prem",
      "description": "Run CDAP on-premises on your own Apache Hadoop or Kubernetes based clusters.",
      "buttonTitle": "Get Started",
      "url": "/get-started/#premises"
    }
  ],
  "why": [
    {
      "title": "Why CDAP",
      "description": "CDAP lets developers, business analysts and data scientists focus on insights, analytics and business value instead of wrestling with infrastructure, and integration.",
      "items": [
        {
          "header": "Reduced complexity",
          "icon": "images/icons/icon-1.svg",
          "paragraph": "CDAP's easy to use abstractions over complex technologies shift focus to insights from infrastructure and integration.",
          "id": "reduced-complexity"
        },
        {
          "header": "Increased velocity",
          "icon": "images/icons/icon-2.svg",
          "paragraph": "With an extensible framework and reusable templates, CDAP accelerates time to value and breaks down silos, so you can build once, run anywhere.",
          "id": "increased-velocity"
        },
        {
          "header": "Increased flexibility",
          "icon": "images/icons/icon-3.svg",
          "paragraph": "CDAP is 100% open source, portable and extensible. It integrates with latest Big Data and Cloud technologies.",
          "id": "increased-flexibility"
        },
        {
          "header": "Improved visibility",
          "icon": "images/icons/icon-4.svg",
          "paragraph": "CDAP gives greater visibility on your data, by allowing to search metadata, and providing insight into data lineage.",
          "id": "improved-visibility"
        }
      ]
    }
  ],
  "features_home": [
    {
      "title": "CDAP features",
      "left_column": [
        {
          "header": "Rapid development",
          "paragraph": "Developer SDK and APIs with abstractions over common data processing patterns; Sandbox mode, programmatic and UI driven debugging; In-memory mode and testing framework to simplify testing; Support for cutting edge Cloud, Apache Hadoop and Apache Spark technologies.",
          "id": "feature_1"
        },
        {
          "header": "Enterprise ready",
          "paragraph": "Metadata repository with automatic technical and operational metadata capture; Business metadata annotations; Data discovery through search based on metadata; Data governance with dataset and field level lineage and auditing; Integration with enterprise security systems.",
          "id": "feature_4"
        },
        {
          "header": "Seamless operations",
          "paragraph": "REST APIs and CLI for every interaction; Time and process based scheduling; Standardized logs and metrics for all execution environments.",
          "id": "feature_2"
        }
      ],
      "right_column": [
        {
          "header": "Portable runtime environments",
          "paragraph": "Build once, run anywhere through portability across runtime environments such as Kubernetes, Apache Hadoop YARN and Docker.",
          "id": "feature_5"
        },
        {
          "header": "Extensible and reusable",
          "paragraph": "Templates and blueprints for common use-cases; Hub for sharing pre-built plugins, applications and solutions; Extensible APIs for security, metadata, runtimes and storage.",
          "id": "feature_3"
        },
        {
          "header": "Hybrid and multi-cloud",
          "paragraph": "Interoperability across on-premises and Cloud environments; Support for all major public cloud providers such as Amazon Web Services, Microsoft Azure and Google Cloud Platform.",
          "id": "feature_6"
        }
      ]
    }
  ],
  "accelerators_home": [
    {
      "title": "Accelerators",
      "items": [
        {
          "title": "Pipelines",
          "url": "/accelerators/pipelines/",
          "urlTitle": "Learn more",
          "image": "/images/accelerators-details-pipeline.jpg",
          "body": "Pipelines provides an easy-to-use graphical data integration interface to bring together data from a myriad of different sources and define transformations visually."
        },
        {
          "title": "Wrangler",
          "url": "/accelerators/wrangler/",
          "urlTitle": "Learn more",
          "image": "/images/accelerators-details-wrangler.jpg",
          "body": "Wrangler allows you to visually and interactively cleanse and prepare raw data, with the aim of making it consumable for further processing. It provides a standardized UI driven interactive flow that takes the pain out of preprocessing tasks for data engineering, data science and data analysis. <a href='#'>Learn More</a>"
        },
        {
          "title": "Analytics",
          "url": "/accelerators/analytics/",
          "urlTitle": "Learn more",
          "image": "/images/accelerators-details-analytics.jpg",
          "body": "Analytics provides a simple, interactive, automated interface for users to easily develop, train, test, evaluate and deploy their machine learning models. "
        },
        {
          "title": "Rules",
          "url": "/accelerators/rules-engine/",
          "urlTitle": "Learn more",
          "image": "/images/accelerators-details-rules.jpg",
          "body": "Rules Engine provides a way for business analysts to create and manage a knowledge base of data transformation rules that need to be automatically applied to your data."
        }
      ]
    }
  ],
  "testimonials": [
    {
      "title": "Testimonials",
      "items": [
        {
          "name": "Stephen Spellicy",
          "job": "SVP of Marketing and Products",
          "company": "Guavus",
          "paragraph": "CDAP provides great value for data pipeline creation, it’s very easy to use yet extremely powerful for our developers and data scientists. We’ve integrated it in our Guavus Reflex Analytics platform where we’re taking advantage of its runtime to accelerate pipeline creation, and we’re exploring additional areas of integration beyond that such as APIs, framework, and marketplace."
        }
      ]
    }
  ],
  "companies": {
    "title": "Companies using CDAP",
    "linkTitle": "Read case studies",
    "linkURL": "/resources/case-studies/",
    "items": [
      {
        "url": "https://google.com",
        "image": "google-logo.png"
      },
      {
        "url": "https://www.guavus.com/",
        "image": "guavus-logo.png"
      },
      {
        "url": "https://www.amaris.ai/",
        "image": "amaris-logo.jpg"
      },
      {
        "url": "https://www.publicissapient.com/",
        "image": "publicissapient.svg"
      },
      {
        "url": "http://www.cybervisiontech.com/",
        "image": "cv-logo@3x.png"
      }
    ]
  }
}
